[
  {
    "id": "1",
    "name_ar": "الرَّحْمَٰنُ",
    "name_tr": "Al-Raḥmān",
    "name_ms": "Maha Pengasih",
    "name_en": "The All-Compassionate",
    "desc_ms": "Allah Ya Raḥmān Yang Maha Pengasih, Maha Pemurah atau Maha Belas Kasihan (rahmat). Dia menaburkan kasih kepada semua makhluk di alam semesta ini walaupun mereka tidak menyembah-Nya dan tidak mengucapkan terima kasih kepada-Nya atau tidak meminta kepada-Nya. Rahmat Allah meliputi segala-galanya.",
    "desc_en": "He is the One who wills Mercy and good for all creation, at all times, He pours upon all creation infinite bounties."
  },
  {
    "id": "2",
    "name_ar": "الرَّحِيمُ",
    "name_tr": "Al-Raḥīm",
    "name_ms": "Maha Penyayang",
    "name_en": "The most merciful",
    "desc_ms": "Allah Ya Raḥīm Maha Penyayang. Allah penyayang kepada hamba-Nya yang beriman. Dengan sayang-Nya Dia memelihara hamba pilihan-Nya untuk tetap berada di dalam redha-Nya. Sayang Allah akan berakhir dengan balasan syurga di akhirat.",
    "desc_en": "He is the source of infinite mercy and benificence, who rewards with eternal gifts the one who uses his bounties for the good."
  },
  {
    "id": "3",
    "name_ar": "الْمَلِكُ",
    "name_tr": "Al-Malik",
    "name_ms": "Maha Berkuasa",
    "name_en": "The Sovereign",
    "desc_ms": "Allah Ya Malik Yang Maha Berkuasa, Maha Memiliki. Dia memiliki seluruh isi langit dan bumi  secara mutlak. Dan Dia memiliki diri kita, tubuh badan kita, anak-anak kita, suami/isteri kita. Dia boleh memberi dan mengambil apa sahaja daripada manusia pada bila-bila masa. Tiada siapa yang mampu menghalang Allah.",
    "desc_en": "He is the owner and ruler of the entire universe, visible and invisible, and of all creation, from before the beginning and after the end."
  },
  {
    "id": "4",
    "name_ar": "الْقُدُّوسُ",
    "name_tr": "Al-Quddūs",
    "name_ms": "Maha Suci",
    "name_en": "The Pure One",
    "desc_ms": "Allah Ya Quddūs bererti Allah Maha Suci, Maha Bersih atau Maha Sempurna dari segala kesalahan, kecacatan atau kekurangan. Penciptaan langit dan bumi membuktikan kesempurnaan penciptaan-Nya dan kekuasaan-Nya. Allah Al—Quddus juga membawa makna Allah mempunyai pekerti yang Maha Mulia diliputi dengan kasih sayang tanpa kebencian. Kesucian Allah Ya Quddus membolehkan Allah menyucikan jiwa-jiwa manusia.",
    "desc_en": "He is the most pure one, devoid of all Blemish, Shortcoming, Weakness, Heedlessness and Error."
  },
  {
    "id": "5",
    "name_ar": "السَّلاَمُ",
    "name_tr": "Al-Salām",
    "name_ms": "Maha Pemberi Sejahtera",
    "name_en": "The Source of Peace",
    "desc_ms": "Allah Ya Salām bererti Maha Sejahtera, Maha Tenang, Maha Menyelamatkan dan Maha Damai. Dia yang memberi kesejahteraan, ketenangan, keselamatan dan kedamaian kepada manusia. Dia memberi kesejahteraan jiwa, pemikiran, emosi dan tubuh badan. Untuk mendapat kesejahteraan dari As-Salam, hendaklah mendekatkan diri dengan-Nya dengan melakukan ketaatan dan ibadah sunat.",
    "desc_en": "He is the One who saves the believing servants from all dangers, bringing them peace, blessings and security of paradise."
  },
  {
    "id": "6",
    "name_ar": "الْمُؤْمِنُ",
    "name_tr": "Al-Mu’min",
    "name_ms": "Maha Mengamankan",
    "name_en": "Giver of Peace",
    "desc_ms": "Allah Ya Mu'min memberi keamanan jiwa, emosi dan jasmani, dibebaskan dari rasa takut dan bimbang. Allah menjaga keamanan kehidupan manusia dan Dia juga mampu memberikan bahaya dan ancaman (Ya Dharr). Untuk mendapat keamanan dari Ya Mukmin, hendaklah beriman kepada Allah, Malaikat, Rasul, Kitab, Akhirat, Qada' dan Qadar.",
    "desc_en": "He is the illuminator of the light of faith in hearts. He is the Comforter, the Protector of the ones who take refuge in Him."
  },
  {
    "id": "7",
    "name_ar": "الْمُهَيْمِنُ",
    "name_tr": "Al-Muhaymin",
    "name_ms": "Maha Pelindung",
    "name_en": "The Guardian",
    "desc_ms": "Ya Allah Ya Muhaymin Maha Pelindung. Dia melindungi hidup manusia daripada bahaya dan bencana. Dia melindungi manusia daripada tergelincir dari jalan kebenaran dan daripada mengikut bisikan syaitan serta memelihara hamba-hamba yang beriman daripada api neraka.",
    "desc_en": "He is the Protector and the Guardian. He is the One who sees to the growth of His creation, leading them where they are destined to go."
  },
  {
    "id": "8",
    "name_ar": "الْعَزِيزُ",
    "name_tr": "Al-‘Azīz",
    "name_ms": "Maha Perkasa",
    "name_en": "The Victorious",
    "desc_ms": "Ya Allah Ya ‘Azīz Yang Maha Perkasa. Dia lebih perkasa daripada segala sesuatu. Keperkasaan-Nya dapat dilihat dalam penciptaan langit dan bumi serta makhluk-Nya. Dia perkasa dalam menguasai setiap makhluk-Nya seperti matahari, bulan, bintang, binatang, gunung serta manusia. Seluruh keperkasaan makhluk-Nya samada manusia, binatang dan sebagainya adalah keperkasaan-Nya. Dia juga mampu memperkasakan jiwa manusia agar cekal dan tabah dalam menghadapi ujian kehidupan.",
    "desc_en": "He is the victorious One whom no force can overwhelm. There is no strength in this universe that can stand before His will."
  },
  {
    "id": "9",
    "name_ar": "الْجَبَّارُ",
    "name_tr": "Al-Jabbār",
    "name_ms": "Maha Pemaksa",
    "name_en": "The Compeller",
    "desc_ms": "Ya Jabbār Yang Maha Memaksa yang kehendak-Nya tidak dapat diingkari oleh sesiapa pun. Pemaksaan-Nya tanda kasih sayang-Nya kepada hamba-hamba pilihan-Nya kerana manusia sering lupa dan lalai. Hanya dengan pemaksaan dan kehendak-Nya manusia akan ingat kepada Allah ketika diri lalai.",
    "desc_en": "He is the repairer of the broken, the completer of the lacking, the one who can enforce His will without any opposition."
  },
  {
    "id": "10",
    "name_ar": "الْمُتَكَبِّرُ",
    "name_tr": "Al-Mutakabbir",
    "name_ms": "Maha Hebat",
    "name_en": "The Greatest",
    "desc_ms": "Allah Ya Mutakabbir Yang Maha Hebat, Maha Memiliki Kebesaran. Dia lebih hebat daripada segala sesuatu. Seluruh kebesaran di atas dunia ini adalah milik-Nya seperti gelaran kemuliaan dan jawatan. Kebesaran-NYa juga membawa erti Dia zat yang Maha Besar yang kebesaran-Nya meliputi kebesaran alam ini. Manusia dan alam semesta sangat kerdil berbanding dengan kebesaran Allah.",
    "desc_en": "He is the greatest, who shows His greatness in everything, on all occassions."
  },
  {
    "id": "11",
    "name_ar": "الْخَالِقُ",
    "name_tr": "Al-Khāliq",
    "name_ms": "Maha Pencipta",
    "name_en": "The Creator",
    "desc_ms": "Allah Ya Khāliq Yang Maha Pencipta menciptakan alam semesta ini serta seluruh isi langit dan bumi tanpa bantuan sesiapa. Dia pencipta dan pemilik mutlak ke atas segalanya. Penciptaan-Nya sangat sempurna, indah dan harmoni. Manusia adalah ciptaan Allah dan sebagai pencipta, Allah mengetahui keperluan manusia dan mengatur segala keperluan manusia di atas dunia ini.",
    "desc_en": "He is the one who creates from nothing, creating at the same time the states, conditions and sustenance of all that He has created. He establishes how, when and where creation will take place."
  },
  {
    "id": "12",
    "name_ar": "الْبَارِئُ",
    "name_tr": "Al-Bārī’",
    "name_ms": "Maha Menjadikan",
    "name_en": "One who gives life",
    "desc_ms": "Ya Bārī’ Yang Maha Merancang merancang dan mengatur kejadian alam diri, merancang kehidupan manusia dan perjalanan seluruh makhluk di dunia ini. Perancangan dan pengaturan-Nya sangat hebat dan sempurna.",
    "desc_en": "He is the one who orders His creation with perfect harmony – not only each thing within itself, but everything in accordance with everything else."
  },
  {
    "id": "13",
    "name_ar": "الْمُصَوِّرُ",
    "name_tr": "Al-Muṣawwir",
    "name_ms": "Maha Pembentuk",
    "name_en": "Fashioner of Shapes",
    "desc_ms": "Allah Ya Muṣawwir mereka bentuk alam semesta dan semua makhluk-Nya dengan cantik dan sempurna serta penuh keunikan dan kreatif. Setiap kreativiti manusia merupakan sifat Allah Ya Muṣawwir, bukan kehebatan kreativiti dan mereka bentuk manusia. Dia mengalirkan sifat Al-Muṣawwir kepada manusia sehingga manusia menjadi kreatif dalam perbuatannya.",
    "desc_en": "He is the one who, without using any model, shapes everything in the most perfect shape."
  },
  {
    "id": "14",
    "name_ar": "الْغَفَّارُ",
    "name_tr": "Al-Ghaffār",
    "name_ms": "Maha Pengampun",
    "name_en": "The Forgiving",
    "desc_ms": "Ya Allah Ya Ghaffār Yang Maha Pengampun sentiasa mengampun dosa hambaNya walaupun dosa itu sebanyak buih di lautan. Walau berulang kali melakukan kesalahan tetapi sekiranya setiap kali melakukan kesalahan dia dan bertaubat dan memohon ampun, pasti akan diampunikan oleh Allah Ya Ghaffār.",
    "desc_en": "He is the One who accepts repentance and forgives."
  },
  {
    "id": "15",
    "name_ar": "الْقَهَّارُ",
    "name_tr": "Al-Qahhār",
    "name_ms": "Maha Menguasai",
    "name_en": "The Dominant",
    "desc_ms": "Ketika manusia berdegil tidak mematuhi perintah Allah, Allah Ya Qahhar akan menghukum agar manusia kembali ke jalan Allah.",
    "desc_en": "He is the ever dominating One, who has surrounded all His creation from without and within with His irresistable power. Nothing can escape Him."
  },
  {
    "id": "16",
    "name_ar": "الْوَهَّابُ",
    "name_tr": "Al-Wahhāb",
    "name_ms": "Maha Pemberi Kurnia",
    "name_en": "The Giver of All",
    "desc_ms": "Allah Ya Wahhāb sentiasa memberi nikmat kepada manusia tanpa meminta balasan dan seringkali Allah memberi tanpa manusia meminta.",
    "desc_en": "He is the donor of all, without conditions, without limits without asking anyone benefit or return, giving everything to everyone, everywhere, always."
  },
  {
    "id": "17",
    "name_ar": "الرَّزَّاقُ",
    "name_tr": "Al-Razzāq",
    "name_ms": "Maha Pemberi Rezeki",
    "name_en": "The Sustainer",
    "desc_ms": "Allah Ya Razzāq memberi rezekiNya kepada setiap makhlukNya. Setiap makhluk samada manusia atau binatang sudah tersedia rezeki masing—masing. Rezeki Allah dalam pelbagai bentuk. Ada dalam bentuk keperluan duniawi seperti makan—minum, kesihatan, wang ringgit, rumah, kenderaan dan sebagainya. Ada dalam bentuk ukhrawi iaitu keimanan dan ilmu mengenal Allah dan syurga. Rezeki merupakan ujian daripada Allah. Allah memerintahkan kita menafkahkan sebahagian daripada rezekiNya kepada orang yang memerlukan.",
    "desc_en": "He is the Sustainer. Sustenance is needed to maintain the creation (both physical and spiritual sustenance)."
  },
  {
    "id": "18",
    "name_ar": "الْفَتَّاحُ",
    "name_tr": "Al-Fattāḥ",
    "name_ms": "Maha Membuka",
    "name_en": "The Opener",
    "desc_ms": "Allah Ya Fattah membuka setiap yang tertutup. Dia membuka pintu rezeki, pintu penyelesaian segala masalah hidup, membuka pintu kasih sayang hati yang tertutup, membuka minda dan pemikiran yang buntu dan tertutup dan membuka setiap sesuatu yang tertutup yang diperlukan oleh manusia. Dia juga mampu membuka jalan ke arahNya dan mendekatkan manusia denganNya dengan membuka pintu hati dan akal.",
    "desc_en": "He is the Opener & the Solver, the Easer of all that is locked, tied and hardened."
  },
  {
    "id": "19",
    "name_ar": "اَلْعَلِيْمُ",
    "name_tr": "Al-‘Alīm",
    "name_ms": "Maha Mengetahui",
    "name_en": "The Knower of All",
    "desc_ms": "Allah Ya Alim mengetahui setiap sesuatu yang berlaku. Dia mengetahui perkara-perkara\nyang ghaib yang di luar jangkauan manusia dan Dia mengetahui apa yang akan berlaku. Tiada sehelai daun pun yang gugur tanpa pengetahuanNya. Ilmu Allah Ya Alim sangat hebat. Kehebatan ilmuNya terserlah dalam kesempurnaan penciptaan makhlukNya. Ya Alim memberikan ilmuNya kepada sesiapa yang dikehendakiNya.",
    "desc_en": "He is the One who knows all. He knows what has happened, what is happening, and what will happen from the beginning to the end."
  },
  {
    "id": "20",
    "name_ar": "الْقَابِضُ",
    "name_tr": "Al-Qābiḍ",
    "name_ms": "Maha Menyempitkan",
    "name_en": "The Constrictor",
    "desc_ms": "Allah Ya Qobid mampu menggenggam, menyempitkan, menghalang. Dia mampu menyempitkan rezeki seseorang sekiranya Dia merasakan perlu sebagai peringatan dan hukuman kepada hambaNya. Dia juga mampu menghalang atau menangguhkan seseorang daripada mendapat sesuatu seperti jawatan, harta, kasih sayang dan sebagainya. Tetapi setiap ketentuan Allah Ya Qobid mempunyai kebaikan yang seringkali tidak mampu difikirkan oleh manusia.",
    "desc_en": "He is the One who constricts. All existence is in the power of Allah. The life on this planet is a test for us, but Allah does not test his servants above their ability."
  },
  {
    "id": "21",
    "name_ar": "الْبَاسِطُ",
    "name_tr": "Al-Bāsiṭ",
    "name_ms": "Maha Meluaskan",
    "name_en": "The Reliever",
    "desc_ms": "Allah Ya Basit mampu melapangkan rezeki seseorang setelah disempitkanNya. Allah melapangkan rezeki seseorang mengikut keperluannya dan kesesuaiannya. Disebalik kelapangan itu tersirat ujian daripada Allah. Setiap kelapangan harus diiringi dengan syukur, digunakan sebagai alat untuk mendekatkan diri kepadaNya dan juga untuk membantu orang lain.",
    "desc_en": "He is the one who releases abundance, joy, relief, and ease after difficulties. These are manifestations of His attribute Al-Baasit."
  },
  {
    "id": "22",
    "name_ar": "الْخَافِضُ",
    "name_tr": "Al-Khāfiḍ",
    "name_ms": "Maha Merendahkan",
    "name_en": "The Abaser",
    "desc_ms": "Allah Ya Khāfiḍ berhak merendahkan atau menghinakan makhlukNya sekiranya Dia merasakan perlu bagi memberi peringatan kepada hambaNya yang lalai. Allah juga mampu menghinakan tempat kembali mereka di akhirat di neraka disebabkan dosa-dosa mereka.",
    "desc_en": "Allah most high is the One who raises His creatures to honour and fame and who can cast them down to the lowest of the low."
  },
  {
    "id": "23",
    "name_ar": "الرَّافِعُ",
    "name_tr": "Al-Rāfi’",
    "name_ms": "Maha Meninggikan",
    "name_en": "The Exalter",
    "desc_ms": "Allah Ya Rafi' mampu meninggikan seseorang mengikut pilihanNya. Dia mampu meninggikan seseorang samada semasa hidup atau selepas mati. Perjuangan manusia semasa hidup akan dinikmati oleh generasi akan datang dan kemaksiatan akan menghinakan generasi akan datang.",
    "desc_en": "Allah most high is the One who raises His creatures to honour and fame and who can cast them down to the lowest of the low."
  },
  {
    "id": "24",
    "name_ar": "الْمُعِزُّ",
    "name_tr": "Al-Mu’izz",
    "name_ms": "Maha Memuliakan",
    "name_en": "The Bestower of Honors",
    "desc_ms": "Kemuliaan itu milik Allah Ya Mu'izz dan Dia memberinya kepada sesiapa yang Dia kehendaki, dan Dia memberi kepada utusanNya dan orang-orang yang beriman. Allah boleh menarik balik kemuliaan itu dengan menghinakan. Orang-orang yang menjadi hamba dunia, pangkat dan wang tidak akan mendapat kemuliaan dari Ya Mu'izz.",
    "desc_en": "He is the One who honours and the One who humiliates."
  },
  {
    "id": "25",
    "name_ar": "المُذِلُّ",
    "name_tr": "Al-Mudhill",
    "name_ms": "Maha Menghinakan",
    "name_en": "The Humiliator",
    "desc_ms": "Allah ya Mudhill berhak dan berkuasa menghinakan seseorang dan tiada siapa yang terlepas daripadaNya. Tiada siapa yang dapat memuliakan seseorang yang dihina Allah. Allah menghina manusia yang melampau batas, zalim, mementing diri sendiri dan sombong. Allah menghina manusia ketika mereka menjauhiNya, melakukan laranganNya dan tidak menghiraukan perintahNya dan ketika manusia lebih takut kepada manusia daripada murka Allah.",
    "desc_en": "He is the One who honours and the One who humiliates."
  },
  {
    "id": "26",
    "name_ar": "السَّمِيعُ",
    "name_tr": "Al-Samī’",
    "name_ms": "Maha Mendengar",
    "name_en": "The Hearer of All",
    "desc_ms": "Allah Ya Sami' mendengar dan mengabulkan permintaan hamba-hambaNya, mendengar keluhan serta puji-pujian kepadaNya. Allah juga mendengar setiap rahsia yang disembunyi oleh hamba-hambaNya. Dia mendengar suara lidah dan suara hati dan menghitungnya.",
    "desc_en": "He is the one who hears all – that which comes from the lips, passes through the minds, is felt by the hearts, the rustling of leaves in the wind, the footsteps of ants and atoms moving through the void."
  },
  {
    "id": "27",
    "name_ar": "الْبَصِيرُ",
    "name_tr": "Al-Baṣīr",
    "name_ms": "Maha Melihat",
    "name_en": "The Seer of All",
    "desc_ms": "Allah Ya Basir Maha Melihat. Dia melihat setiap perbuatan manusia dan menghitung setiap perbuatan tersebut. Tiada sesuatupun yang boleh terlepas daripada pandangan dan perhatian Allah.",
    "desc_en": "He is the One who is all-seeing. He sees all that has passed, all there is, and all there will be until the end of time."
  },
  {
    "id": "28",
    "name_ar": "الْحَكَمُ",
    "name_tr": "Al-Ḥakam",
    "name_ms": "Maha Memberi Hukuman",
    "name_en": "Maker of Immutable Judgements",
    "desc_ms": "Allah Ya Hakam mempunyai ketetapan hukum terhadap manusia. Allah menetapkan hukum untuk kebaikan manusia dan agar manusia mengikut jalan yang benar. Tiada siapa yang boleh menghalang dan mengingkari hukuman Allah. Manusia harus menerima apa sahaja hukum Allah sebagai anugerah dan nikmat, bukan bencana.",
    "desc_en": "He is the One who orders. He is the bringer of justice and truth. He judges, and executes His justice."
  },
  {
    "id": "29",
    "name_ar": "الْعَدْلُ",
    "name_tr": "Al-‘Adl",
    "name_ms": "Maha Adil",
    "name_en": "The Equitable",
    "desc_ms": "Allah Ya 'Adl bersifat Maha Adil kepada makhlqNya. Seseorang tidak akan dirugikan dan dibalasi mengikut apa yang dia kerjakan. Jalan keburukan yang dilalui oleh manusia akan dibalas dengan adil oleh Allah Ya Adl. Manusia harus menerima pengadilan Allah dengan penuh rasa nikmat kerana kasih sayangNya menyelamatkan kita daripada bencana. Seringkali apa yang disukai Allah tidak disukai manusia dan apa yang dibenci Allah disukai manusia. Oleh itu sentiasa ingat bahawa setiap pengadilan Allah itulah yang paling adil dan baik untuk manusia dan terimalah dengan redha.",
    "desc_en": "He is the absolute justice. Justice secures peace, balance order and harmony. Allah the just is the enemy of tyrants."
  },
  {
    "id": "30",
    "name_ar": "اللَّطِيفُ",
    "name_tr": "Al-Laṭīf",
    "name_ms": "Maha Lembut",
    "name_en": "The Kind",
    "desc_ms": "Allah Maha Lembut membawa erti hasil ciptaanNya maha halus. Setiap takdir ke atas manusia penuh kebaikan dan hikmah dan Allah melihat sesuatu dengan penuh lembut dan halus. Allah Ya Latif juga melayan hamba-hambaNya dengan penuh kelembutan dan kasih sayang. Kelembutannya dapat dirasai ketika dimaafkan segala kesalahan kita ketika kita memohon ampun, dimakbulkan segala keperluan ketika kita memohon, diselamatkan dari bala bencana ketika kita memohon perlindungan.",
    "desc_en": "He is the most delicate, fine, gentle, beautiful one, He is the one who knows the finest details of beauty. The finest of His beauties are hidden in the secrets of the beauties of the soul, wisdom, and divine light."
  },
  {
    "id": "31",
    "name_ar": "الْخَبِيرُ",
    "name_tr": "Al-Khabīr",
    "name_ms": "Maha Waspada",
    "name_en": "The All-Aware",
    "desc_ms": "Allah Ya Khobiir Yang Maha Waspada sentiasa benrwaspada terhadap tingkahlaku manusia. Sekiranya manusia terseleweng, maka akan diperbetulkan ke jalan yang benar.",
    "desc_en": "He is the one who is aware of the hidden inner occurrences in everything. He is the one whose cognisance reaches the deepest, darkest, hidden corners of His kingdom, where neither human intelligence nor His angels can penetrate."
  },
  {
    "id": "32",
    "name_ar": "الْحَلِيمُ",
    "name_tr": "Al-Ḥalīm",
    "name_ms": "Maha Penyantun",
    "name_en": "The Forbearing",
    "desc_ms": "Allah Ya Halim Yang Maha Penyantun sentiasa bersifat santun kepada hamba-hambaNya walaupun mereka tidak santun kepadaNya. Dia santun dalam memberikan nasihat dan teguran, santun dalam layanan, santun dalam perkataan, santun dalam tindakbalas kasar hambaNya.",
    "desc_en": "He is forbearing in the punishment of the guilty. He waits, giving time to the sinner to realise his guilt and ask for forgiveness in order that He may forgive him rather than punish him."
  },
  {
    "id": "33",
    "name_ar": "الْعَظِيمُ",
    "name_tr": "Al-‘Aẓīm",
    "name_ms": "Maha Agung",
    "name_en": "The Magnificent",
    "desc_ms": "Allah Ya 'Aẓīm Yang Maha Agong memiliki seluruh isi langit dan bumi. KeagunganNya mengatasi keagungan manusia kerana manusia hanyalah hamba yang menggunakan pinjaman dan amanah Allah secara sementara. Allahlah pemilik yang mutlak dan dia mampu berbuat apa sahaja kepada sesiapa sahaja tanpa keizinan hamba-hambaNya. Dia mengurus, mengatur dan mengawal setiap makhlukNya tanpa bantuan dan begitu sempurna tanpa cacat cela.",
    "desc_en": "He is the greatest on the earth below and in the heavens above, in realms where our sight cannot reach and of which our minds cannot conceive. He is the absolute and perfect greatness."
  },
  {
    "id": "34",
    "name_ar": "الْغَفُورُ",
    "name_tr": "Al-Ghafūr",
    "name_ms": "Maha Pengampun",
    "name_en": "The Forgiver",
    "desc_ms": "Allah Ya Ghafūr Yang Maha Pengampun mengampun dosa hambaNya tidak kira sebesar mana dosa tersebut (selain dosa syirik). Allah Ya Ghofuur Yang Maha Pengampun mengampuni hambaNya walaupun dosa hambaNya sebanyak buih di lautan. Setiap kali hambaNya melakukan dosa dan kemudian memohon ampun kepada Allah Ya Ghofuur, pasti Dia akan mengampunkan dosa mereka. Seorang hamba semestinya lah sentiasa memohon keampunan daripada Allah Ya Ghofuur kerana tanpa keampunanNya pastilah seseorang itu akan menerima azab api nerakaNya di akhirat kelak.",
    "desc_en": "He is the most forgiving one. He veils our faults from the eyes of other men, from the angels and relieves us from the suffering of continual remembrance of our faults."
  },
  {
    "id": "35",
    "name_ar": "الشَّكُورُ",
    "name_tr": "Al-Syakūr",
    "name_ms": "Maha Mensyukuri",
    "name_en": "The Rewarder of Thankfulness",
    "desc_ms": "Allah Ya Syakuur Yang Maha Mensyukuri dan Menghargai sentiasa menghargai hamba-hambaNya yang mentaatinya dan mengikut perintahNya serta melakukan kebaikan dan amal soleh. Dia Ya Syakuur akan sentiasa menunjukkan penghargaanNya dengan mengalirkan kasih sayangNya, mengalirkan rezeki dan kekayaanNya, memberikan perlindunganNya dan memberikan balasan syurga di akhirat kelak.",
    "desc_en": "He is the one who repays a good deed with a much greater reward. Thankfulness is to return good with good."
  },
  {
    "id": "36",
    "name_ar": "الْعَلِيُّ",
    "name_tr": "Al-‘Alīy",
    "name_ms": "Maha Tinggi",
    "name_en": "The Highest",
    "desc_ms": "Allah Ya Aliy Yang Maha Tinggi mempunyai kedudukan yang lebih tinggi daripada yang ditakluki dan dikalahkan, sekali gus menakluki makhlukNya. Kedudukan Allah Ya Aliy mencapai puncak tertinggi di tempat yang tinggi. Dia Maha Tinggi disebabkan Zat dan sifat-sifatNya, lebih daripada gambaran makhlukNya. Dia Ya Aliy menganugerahkan darjat ketinggian kepada hamba-hamba pilihanNya seperti para nabi dan rasul.",
    "desc_en": "He is the highest One. He is higher than the whole of the created universe. His nearness and farness and His being high cannot be measured by the limits of human intellect."
  },
  {
    "id": "37",
    "name_ar": "الْكَبِيرُ",
    "name_tr": "Al-Kabīr",
    "name_ms": "Maha Besar",
    "name_en": "The Greatest",
    "desc_ms": "Allah Ya Kabir Yang Maha Besar merupakan ungkapan kesempurnaan zat. KebesaranNya menyebabkan Dia tidak memerlukan kepada sesiapapun, malah semua makhlukNya memerlukan kepadaNya.",
    "desc_en": "He is the greatest, whose greatness stretches from before the beginning until after the end. There is no difference for Him between the creation of an atom and the infinite –seeming universe. This is His grandeur as much as we can understand it. He is greater than that."
  },
  {
    "id": "38",
    "name_ar": "الْحَفِيظُ",
    "name_tr": "Al-Ḥafīẓ",
    "name_ms": "Maha Penjaga",
    "name_en": "The Preserver",
    "desc_ms": "Allah Ya Hafiz Yang Maha Memelihara dan Menjaga seluruh ciptaanNya. Tidak ada satu pun yang terlepas daripada jagaanNya. Dia memelihara langit dan bumi dan setiap apa yang ada di antara keduanya. Manusia dijaga oleh Malaikat atas perintah Allah. Diantara pemeliharaan Allah ke atas manusia adalah dikurniakan kesihatan yang baik. Walaupun begitu melalui kesakitan, Allah Ya Hafiz memelihara jiwa kita agar sentiasa ingat kepadaNya dan ketika sakit manusia mampu merenungi apa yang berlaku di sekelilingnya terutama berinteraksi dengan Tuhan yang selama ini dilupakannya. Ujian kesusahan dan kesakitan adalah cara Allah menyelamatkan hambaNya dari azab api neraka. Allah Ya Hafiz juga mampu melindungi kita daripada bisikan hawa nafsu dan syaitan.",
    "desc_en": "He is the one who remembers all that was and all that is, keeping in His divine protection all that there will be."
  },
  {
    "id": "39",
    "name_ar": "المُقيِت",
    "name_tr": "Al-Muqīt",
    "name_ms": "Maha Memberi Kekuatan dan Kecukupan",
    "name_en": "The Nourisher",
    "desc_ms": "Allah Ya Muqit Yang Maha Memberi Kekuatan dan Kecukupan. Allah Ya Muqit mencukupkan keperluan manusia, berkuasa ke atas manusia serta mampu menggenggam manusia mengikut kehendakNya. Allah Ya Muqit juga mencukupkan rasa kebahagiaan dan kepuasan kepada hamba-hambaNya hasil daripada amalan dan ketaatan hamba itu kepada Allah.",
    "desc_en": "He is the nourisher of all creation. Allah creates the nourishment of His creatures before He creates them. No one can take away the nourishment destined for each element of creation."
  },
  {
    "id": "40",
    "name_ar": "الْحسِيبُ",
    "name_tr": "Al-Ḥasīb",
    "name_ms": "Maha Pembuat Perhitungan",
    "name_en": "The Accounter",
    "desc_ms": "Allah Ya Hasib Yang Maha Menghisab, Menghitung atau Maha Mencukupi. Allah Ya Hasib mencukupkan segala keperluan makhlukNya tidak lebih dan tidak kurang, semuanya telah ditetap dan diatur oleh Allah. Apabila Allah Ya Hasib mencukupkan anugerah dan keperluan seseorang, tiada siapapun yang boleh mengurangkannya. Allah Ya Hasib juga menghitung setiap perbuatan manusia walau sebesar biji zarah sekalipun dan setiap kebaikan itu akan dibalas dengan adil, begitu juga dengan keburukan dan kejahatan.",
    "desc_en": "He is the one who takes account of all and everything that His creation does or is subjected to."
  },
  {
    "id": "41",
    "name_ar": "الْجَلِيلُ",
    "name_tr": "Al-Jalīl",
    "name_ms": "Maha Mempunyai Keagungan dan Kesempurnaan",
    "name_en": "The Mighty",
    "desc_ms": "Allah Ya Jalil Yang Maha Mempunyai Keagungan dan Kesempurnaan, maha kaya, maha suci, maha luas dan semuanya. Apabila sifat Al-Jalil mampu dilihat dengan mata hari akan nampaklah kecantikan dan keindahan Allah. Ia akan melahirkan suasana kekaguman yang luar biasa, akan membangkitkan kehairanan, ketakjuban dan penghargaan yang tak terhingga sehingga tidak mampu digambarkan dengan kata—kata.",
    "desc_en": "He is the lord of majesty and might. His might and His greatness, His eternity bears no resemblance to any energy, matter or time."
  },
  {
    "id": "42",
    "name_ar": "الْكَرِيمُ",
    "name_tr": "Al-Karīm",
    "name_ms": "Maha Pemurah",
    "name_en": "The Generous",
    "desc_ms": "Allah Ya Karim Yang Maha Mulia, Maha Pemurah, Maha Dermawan dan memberi tanpa hitungan, tak pernah menghalang siapapun untuk datang kepadaNya dan gembira memberi anugerah kepada makhlukNya. Kemuliaan Allah Ya Karim juga digambarkan ketika Allah memberi pendidikan, pemeliharaan dan pembaikan kepada makhlukNya. Allah Ya Karim tak pernah memutuskan harapan hambaNya yang meminta kepadaNya.",
    "desc_en": "He is the generous One. His greatest generosity is His Mercy, through which He forgives when He could punish."
  },
  {
    "id": "43",
    "name_ar": "الرَّقِيبُ",
    "name_tr": "Al-Raqīb",
    "name_ms": "Maha Mengawasi",
    "name_en": "The Watchful One",
    "desc_ms": "Allah Ya Roqib yang Maha Mengawasi sentiasa mengawasi hambaNya. Dia Ya Roqib mengawasi daripada bisikan syaitan dan nafsu, daripada kejahatan dan dosa, penyelewengan. Apabila Dia mendapati hambaNya terleka dan tersasar, Dia akan menegur dengan memberi sedikit ujian dan musibah sebagai peringatan. Ketika hamba sedang diuji, pada hakikatnya Allah Ya Roqib mengawasi kerana sayang kepada hambaNYa. Ibubapa boleh memohon Allah Ya Roqib untuk mengawasi anak—anaknya daripada kejahatan dan dosa apabila sudah tiada daya upaya dan keadaan yang begitu mencabar.",
    "desc_en": "He is the One who watches everything, always. This scrutiny of every detail in the existence of all creation is in part protective."
  },
  {
    "id": "44",
    "name_ar": "الْمُجِيبُ",
    "name_tr": "Al-Mujīb",
    "name_ms": "Maha Mengabulkan",
    "name_en": "The Responder to Prayer",
    "desc_ms": "Allah Ya Mujib Yang Maha Mengabulkan pasti menjawab dan memberi response kepada setiap keluhan, permohonan dan rayuan hambaNya. Allah memberi masalah dan ujian hanya semata-mata untuk menguji tahap keimanan dan keyakinan hambaNya. Ya Mujib berhak mempercepat atau melambatkan pengabulan hajat hambaNya kerana kebijaksanaanNya dalam menentukan samada hajat itu membawa manafaat atau mudarat. Doa hajat hendaklah dipohon dengan penuh yakin dan sedar. Allah Ya Mujib tidak pernah jemu dengan keluhan dan permintaan hamba-hambaNya.",
    "desc_en": "He is the one who responds to all the needs of His servants. Allah is closer to His creatures than they are to themselves. He is not any closer to a saint than He is to you or a mustard seed."
  },
  {
    "id": "45",
    "name_ar": "الْوَاسِعُ",
    "name_tr": "Al-Wāsi’",
    "name_ms": "Maha Luas",
    "name_en": "The All-Comprehending",
    "desc_ms": "Allah Ya Wasi' Yang Maha Luas pemberian dan nikmatNya yang tidak dapat dihitung dan diperincikan. Allah Ya Wasi' juga Maha Luas ilmuNya, Maha Luas kekuasaanNya, Luas petunjuk dan bimbinganNya, Luas rezekiNya, Luas keampunanNya dan ganjaranNya.",
    "desc_en": "He is the limitless vastness, whose knowledge, mercy, power, generosity and all other beautiful attributes are infinite."
  },
  {
    "id": "46",
    "name_ar": "الْحَكِيمُ",
    "name_tr": "Al-Ḥakīm",
    "name_ms": "Maha Bijaksana",
    "name_en": "The Perfectly Wise",
    "desc_ms": "Ya Allah Ya Hakim Yang Maha Bijaksana, kebijaksanaanNya tidak mampu difikirkan dan difahami oleh sesiapa kecuali Nabi Muhammad s.a.w. Dia bertindak penuh hikmah bagi menampakkan kekuasaanNya. KebijaksanaanNya tidak mampu dilihat dengan pandangan zahir, bahkan hanya dengan pandangan mata hati. Semua tindakan Allah penuh dengan kebijaksanaan. Penciptaan alam ini juga melambangkan kebijaksanaan Allah Ya Hakim yang mana semuanya berlaku penuh harmoni dan saling berkait.",
    "desc_en": "He is the perfectly wise, in His knowledge and in His deeds. There is no doubt or uncertainty in His knowledge, nor does it have an end."
  },
  {
    "id": "47",
    "name_ar": "الْوَدُودُ",
    "name_tr": "Al-Wadūd",
    "name_ms": "Maha Menyintai",
    "name_en": "The Loving One",
    "desc_ms": "Allah Ya Wadud Yang Maha Pencinta mencintai makhlukNya dengan kecintaan yang suci, abadi dan luar biasa. Cinta adalah ciptaan pertama yang dicipta yang melahirkan kekuatan kreativiti dan kehidupan yang sangat indah di dunia ini. Dia Ya Wadud mengalirkan rasa cinta ke dalam jiwa hamba-hambaNya agar mencintaiNya dan sesama makhluk.",
    "desc_en": "He is the one who loves His good servants. He is the only one who is worthy of love."
  },
  {
    "id": "48",
    "name_ar": "الْمَجِيدُ",
    "name_tr": "Al-Majīd",
    "name_ms": "Maha Mulia",
    "name_en": "The Majestic One",
    "desc_ms": "Ya Allah Ya Majid Yang Maha Mulia memuliakan hamba pilihanNya sehingga Dia mampu mengkayakan seorang hamba tanpa harta, dicukupkan segala keperluan tanpa usaha dan dimuliakan tanpa susah payah. Begitu juga sebaliknya Dia mampu menimpakan musibah secara mendadak. Disebabkan kemuliaan itu hak Allah Ya Majid, manusia tidak boleh berbangga apabila dipuji kerana segala sifat baik dan terpuji itu adalah sifat Allah Ya Majid.",
    "desc_en": "Allah most high is glorious and majestic in the whole of His creation and beyond. No hand reaches Him, no power can touch Him, yet He is closer to His servants than their own souls. His state is pure perfection. His acts are pure wisdom."
  },
  {
    "id": "49",
    "name_ar": "الْبَاعِثُ",
    "name_tr": "Al-Bā’ith",
    "name_ms": "Maha Membangkitkan",
    "name_en": "The Resurrector",
    "desc_ms": "Ya Allah Ya Baa'ith yang Maha Membangkitkan. Dia membangkitkan manusia selepas kematian, membangkitkan selepas tidur, membangkitkan lintasan hati untuk kebaikan dan keburukan. Allah Ya Ba'ith mampu membangkitkan ketenangan jiwa kepada hamba pilihanNya sehingga lahir keilkhlasan, rela, redha dan mahu menurut apa sahaja kehendakNya. Keikhlasan adalah kunci utama bagi mendekatkan diri pada Allah dan mendapatkan cahaya dariNya.",
    "desc_en": "He is the raiser from the dead. Allah will give life back to all creation on the day of judgement."
  },
  {
    "id": "50",
    "name_ar": "الشَّهِيدُ",
    "name_tr": "Al-Syahīd",
    "name_ms": "Maha Menyaksikan",
    "name_en": "The Witness",
    "desc_ms": "Ya Allah Ya Syahid Yang Maha Menyaksikan yang membawa erti Allah wujud, hadir, melihat dan menyaksikan setiap perbuatan manusia dan apa sahaja yang berlaku di alam semesta. Allah Ya Syahid menjadikan anggota manusia berkata-kata sebagai saksi perbuatan manusia di dunia. Allah menyaksikan apa yang dizahirkan\noleh manusia dan apa yang disembunyikan di dalam hati.",
    "desc_en": "He is the one who witnesses all that happens everywhere at all times."
  },
  {
    "id": "51",
    "name_ar": "الْحَقُّ",
    "name_tr": "Al-Ḥaqq",
    "name_ms": "Maha Benar",
    "name_en": "The Truth",
    "desc_ms": "Allah Ya Haq Yang Maha Benar adalah sumber kebenaran. KalimahNya benar, janjiNya benar, balasan dan azabNya benar, akhiratNya benar, cinta dan kasih sayangNya benar dan apa yang dibawa oleh Nabi dan rasulNya benar. Oleh itu hendaklah kita bersandarkan dan bersumberkan daripada kebenaran Allah Ya Haq dalam setiap kata-kata, perbuatan, ibadah, hukuman dan seluruh tindakan kita di dunia ini.",
    "desc_en": "Allah is the truth, whose being is ever unchanged."
  },
  {
    "id": "52",
    "name_ar": "الْوَكِيلُ",
    "name_tr": "Al-Wakīl",
    "name_ms": "Maha Pemegang Amanah",
    "name_en": "The Trustee",
    "desc_ms": "Allah Ya Wakil Yang Maha Menguruskan Amanah melaksanakan urusan pentadbiran di dunia ini dengan penuh kesempurnaan. Sebagai seorang hamba yang tidak berdaya, seharusnya kita menyerahkan segala urusan kita\nkepada Allah Ya Wakil. Dia Ya Wakil pasti menjadi wakil yang amanah dan sempurna dalam menguruskan urusan hambaNya.",
    "desc_en": "Allah is the ultimate and faithful trustee. Men think that they are able to do, but He is the one who does everything. He can replace everything in the universe, but nothing can replace Him nor can stand on its own without being dependent on Him."
  },
  {
    "id": "53",
    "name_ar": "الْقَوِيُّ",
    "name_tr": "Al-Qawīy",
    "name_ms": "Maha Kuat",
    "name_en": "Almighty",
    "desc_ms": "Allah Ya Qowiy yang Maha Kuat mempunyai kekuatan yang maha hebat yang tiada siapa mempunyai kekuatan sepertiNya. Dia Ya Qowiy mampu menggerakkan bulan, matahari, bumi dan bintang. KekuatanNya mampu menenggalamkan bumi dan manusia. KekuatanNya juga mampu mengalahkan seluruh musuh walaupun seluruh manusia dan jin berkumpul untuk mengalahkanNya sudah pasti tidak akan mampu. Kekuatan yang ada pada manusia merupakan kekuatan Allah Ya Qowiy dan bukanlah kekuatan manusia sesungguhnya.",
    "desc_en": "Allah is the most strong one, the inexhaustible. He possesses all strength. He can create a billion universes with the same ease with which He creates a blade of grass."
  },
  {
    "id": "54",
    "name_ar": "الْمَتِينُ",
    "name_tr": "Al-Matīn",
    "name_ms": "Maha Teguh",
    "name_en": "The Forceful One",
    "desc_ms": "Ya Allah Ya Matin Yang Maha Teguh, seluruh keteguhan yang ada di dunia ini adalah keteguhan Allah. KeteguhanNya lah yang menjadikan gunung-gunung teguh menjadi pasak bumi, kedudukan bulan, bintang dan matahari sangat teguh, tidak bergoyang sedikitpun dalam peredarannya. Keteguhan yang ada dalam setiap ciptaanNya merupakan keteguhan Ya Matin. Begitu juga manusia yang teguh jiwa dan iman merupakan anugerah Allah Ya Matin yang menyebabkan manusia mampu menghadapi apa jua dugaan hidup dengan penuh keteguhan dan kesabaran.",
    "desc_en": "Allah is perfect in His strength and His firmness. None can be saved from this strength, no force can oppose it and nothing can weaken it."
  },
  {
    "id": "55",
    "name_ar": "الْوَلِيُّ",
    "name_tr": "Al-Walīy",
    "name_ms": "Maha Melindungi",
    "name_en": "The Governor",
    "desc_ms": "Ya Allah Ya Waliy Yang Maha Melindungi lagi Maha mengurus. Ya Waliy juga sentiasa menolong dan membantu hamba-hambaNya yang dalam kesusahan dan ketika mereka dalam kesesatan. Allah Ya Waliy membimbing dan memberi rasa tenteram dan memberikan kejayaan dalam urusan hamba-hambaNya di dunia dan akhirat. Bagi hamba yang menjadikan Allah sebagai walinya, Allah akan menjaga dan membantu orang itu daripada segala yang dihajatinya dan sentiasa berada dalam taufik dan hidayah Allah.",
    "desc_en": "Allah is the protecting friend of His good servants. He eliminates their difficulties and gives them guidance, peace and success in their affairs in this world and in the hereafter."
  },
  {
    "id": "56",
    "name_ar": "الْحَمِيدُ",
    "name_tr": "Al-Ḥamīd",
    "name_ms": "Maha Terpuji",
    "name_en": "The Praised One",
    "desc_ms": "Allah Ya Hamid menciptakan sesuatu dengan baik dan Allah mempunyai sifat yang terpuji dan segala perbuatan terpuji itu adalah sifatNya. Dia Ya Hamid layak untuk menerima pujian kerana Dia yang mencipta dan menghidupkan, yang menganugerahkan keperluan hidup dan Dia yang memberi petunjuk sehingga manusia mencapai kebahagiaan dunia dan akhirat. Allah Ya Hamid layak mendapat pujian bukan hanya ketika menerima kesenangan tetapi juga ketika menerima kesempitan dan bencana kerana ianya merupakan proses pendidikan Allah kepada hamba-hambaNya. Seorang hamba hendaklah berbaik sangka dengan Allah walaupun apa pun yang dilakukan Allah kepadanya.",
    "desc_en": "Allah is most praiseworthy, all that exist praise Allah with their tongues, with their action, or simply by their very existence. He is the only one who is worthy of devotion, respect, thankfulness and praise."
  },
  {
    "id": "57",
    "name_ar": "الْمُحْصِي",
    "name_tr": "Al-Muḥsī",
    "name_ms": "Maha Menghitung",
    "name_en": "The Appraiser",
    "desc_ms": "Allah Ya Muhsi Yang Maha Menghitung sentiasa menghitung amalan dan perbuatan hambaNya walaupun mungkin hambaNya lupa. Setiap perhitungan itu pasti akan dibalas diakhirat kelak kerana Allah itu hakim yang seadil-adilnya.",
    "desc_en": "Allah is the possessor of all quantitative knowledge. He sees and knows everything in its reality. He knows the number of all existence in the universe down to the number of breaths exhaled and inhaled by each of His creatures."
  },
  {
    "id": "58",
    "name_ar": "الْمُبْدِئُ",
    "name_tr": "Al-Mubdi'",
    "name_ms": "Maha Memulai",
    "name_en": "The Originator",
    "desc_ms": "Allah Ya Mubdi' Yang Maha Memulai, Dialah yang memulai menciptakan makhlukNya dan tidak ada yang mendahului Allah dalam penciptaanNya. KehebatanNya lah dalam penciptaan alam ini yang membolehkan Ya Mubdi', mencipta dan menguruskan makhlukNya tanpa bantuan dan Dia yang memulai setiap apa yang ada di dunia ini.",
    "desc_en": "Allah is the originator of all. He creates without model or material."
  },
  {
    "id": "59",
    "name_ar": "الْمُعِيدُ",
    "name_tr": "Al-Mu’īd",
    "name_ms": "Maha Mengembalikan",
    "name_en": "The Restorer",
    "desc_ms": "Allah Ya Mu'id Yang Maha Mengembalikan mengembalikan manusia kepadaNya di hari akhirat untuk dihisab dan diadili akan setiap perbuatan mereka di atas dunia ini. Dia Ya Mu'id juga mampu mengembalikan hamba-hamba pilihanNya kepada fitrah yang asal sehingga mereka ini mampu hidup sebagai hamba kepada Allah s.w.t dan pengikut Rasulullah s.a.w.",
    "desc_en": "Allah is the restorer of the things that He has created and destroyed."
  },
  {
    "id": "60",
    "name_ar": "الْمُحْيِي",
    "name_tr": "Al-Muḥyī",
    "name_ms": "Maha Menghidupkan",
    "name_en": "The Giver of Life",
    "desc_ms": "Allah ya Muhyi Yang Maha Menghidupkan mampu menghidupkan sesuatu yang telah mati samada tanah yang mati, manusia, termasuk jiwa. Jiwa yang dihidupkan oleh Allah Ya Muhyi akan subur dan mampu mengenal Allah sehingga mampu sentiasa melakukan ketaatan dan kebaikan.",
    "desc_en": "Allah is the giver of life to things without life. Allah is the one who has created life and who has created death, no one else can do that."
  },
  {
    "id": "61",
    "name_ar": "اَلْمُمِيتُ",
    "name_tr": "Al-Mumīt",
    "name_ms": "Maha Mematikan",
    "name_en": "The Taker of Life",
    "desc_ms": "Allah Ya Mumit Yang Maha Mematikan, Dia memegang nyata makhlukNya dan mampu mematikan pada bila-bila masa, di mana jua tanpa ada yang mampu menahanNya. Begitu juga sekiranya Dia Ya Mumit ingin menahan kematian seseorang, maka tiada siapa yang mampu mematikannya. Orang yang dekat dengan Allah tidak takut mati kerana kematian merupakan jalan untuk berjumpa Allah Ya Wadud yang dirindui.",
    "desc_en": "Allah is the creator of death. All who are alive will certainly die. Man is made of a combination of the flesh and the soul. The body is temporal, the soul is eternal."
  },
  {
    "id": "62",
    "name_ar": "الْحَيُّ",
    "name_tr": "Al-Ḥayy",
    "name_ms": "Maha Hidup",
    "name_en": "The Ever Living One",
    "desc_ms": "Allah hidupNya kekal, tidak pernah musnah dan tidak terikat oleh sebarang syarat dan keadaan. Dia yang memberi kehidupan kepada makhluk. Dia terus hidup, tidak pernah tidur atau mengantuk atau letih.",
    "desc_en": "Allah is the perfectly alive and ever living one. Allah is cognizant of all, and all actions are His. All that is known and will be known is within His knowledge. All existence is always comprehended in His action."
  },
  {
    "id": "63",
    "name_ar": "الْقَيُّومُ",
    "name_tr": "Al-Qayyūm",
    "name_ms": "Maha Berdiri Dgn Sendiri",
    "name_en": "The Self-Existing One",
    "desc_ms": "Allah Ya Qayyum berdiri sendiri lagi maha tegak. Dia mengatur segala sesuatu yang menjadi keperluan makhlukNya secara sempurna, terus menerus tanpa bantuan sesiapa. Dia tidak memerlukan ketaatan hambaNya mahupun tidak berkurang kekuasaan dan kemuliaanNya sekiranya semua makhlukNya menjauhkan diri dariNya.",
    "desc_en": "Allah is the ever self-existing one upon whom the existence of all depends. His existence depends upon none other than Himself."
  },
  {
    "id": "64",
    "name_ar": "الْوَاجِدُ",
    "name_tr": "Al-Wājid",
    "name_ms": "Maha Menemukan",
    "name_en": "The Finder",
    "desc_ms": "Allah Ya Waajid Yang Maha Menemukan. Dia yang menemukan jalan keluar kepada hamba-hambaNya yang dalam kesusahan dan Dia juga menemukan jalan menuju kepadaNya. Allah Ya Waajid telah memberikan sepenuh potensi kepada manusia untuk menjadi khalifah di bumi ini, tetapi seringkali potensi itu tertutup seperti awan menutup gunung yang indah, manusia akan menemui potensi diri itu apabila mampu menyingkap tabir itu dengan membersihkan diri dari dosa-dosa dan mendekatkan diri kepada Allah Ya Waajid.",
    "desc_en": "Allah finds and obtains whatever He wishes whenever He wishes. It is even superfluous to use the word \"FIND\" because all is in His presence at all times."
  },
  {
    "id": "65",
    "name_ar": "الْمَاجِدُ",
    "name_tr": "Al-Mājid",
    "name_ms": "Maha Luas Kemuliaan",
    "name_en": "The Glorious",
    "desc_ms": "Allah Ya Maajid Yang Maha Mulia, dan Dialah yang menunjukkan kebaikan dan kemuliaan yang tidak terhingga kepada makhlukNya. Dengan kebaikan dan kemuliaan Allah Ya Maajid seseorang hambaNya mampu berbuat kebaikan dan dipandang mulia oleh Allah walaupun dia mendapat penghinaan manusia. Kemuliaan Allah Ya Maajid mampu melahirkan keyakinan yang luar biasa yang akan melahirkan kekuatan luar biasa pada otak dan tindakan.",
    "desc_en": "Allah is the most glorious, who shows infinite generosity and munificence to those close to Him."
  },
  {
    "id": "66",
    "name_ar": "الْواحِدُ",
    "name_tr": "Al-Wāḥid",
    "name_ms": "Maha Esa",
    "name_en": "The Indivisible",
    "desc_ms": "Allah Ya Waahid Yang Maha Esa tuhan yang satu. Tidak ada yang berhak disembah melainkanNya. Dia adalah permulaan segala sesuatu dan sumber kewujudan semua makhluk.",
    "desc_en": "Allah is one. He has no equal, none like Him nor any partner in His essence, in His attributes, in His actions, in His orders, or in His beautiful Names."
  },
  {
    "id": "67",
    "name_ar": "اَلاَحَدُ",
    "name_tr": "Al-Aḥad",
    "name_ms": "Maha Tunggal",
    "name_en": "The One Unequalled",
    "desc_ms": "Allah Ya Ahad Yang Maha Tunggal dzatNya, tidak ada yang menyerupai dan dan menyamaiNya. Allah unik. Dia Maha Tunggal pada sifat-sifatNya, tidak ada yang seumpama denganNya. Tiada sekutu bagiNya dan Dia tidak bergantung kepada siapa pun. Dia menyendiri dengan segala kesempurnaan, keagungan, kebesaran, keindahan, pujian, hikmah, rahmah dan selainnya dari sifat-sifat kesempurnaan.",
    "desc_en": "He is the unity in which all names, attributes and their relations to any and all are united."
  },
  {
    "id": "68",
    "name_ar": "الصَّمَدُ",
    "name_tr": "Al-Ṣamad",
    "name_ms": "Maha Diperlukan",
    "name_en": "The Satisfier of All Needs",
    "desc_ms": "Allah Ya Somad Yang Maha diperlukan, Dia diperlukan oleh setiap makhlukNya dan padanya kesudahan segala kekuasaan dan kemuliaan. Allah Ya Somad mengetahui setiap keperluan hamba-hambaNya dan memenuhi keperluan itu mengikut kehendakNya.",
    "desc_en": "Allah is the satisfier of all needs, and all is in need of Him. He is the sole recourse; the only place of support where one may go to rid oneself of all trouble and to receive all that one needs through the blessings of this name."
  },
  {
    "id": "69",
    "name_ar": "الْقَادِرُ",
    "name_tr": "Al-Qādir",
    "name_ms": "Maha Berupaya",
    "name_en": "The All Powerful",
    "desc_ms": "Ya Qadir Yang Maha Berupaya, Dia berupaya melakukan apa sahaja yang dikehendakiNya apabila Dia menghendakinya. Kekuasaan Allah Ya Qadir tercermin dalam penciptaan alam semesta.",
    "desc_en": "Allah is the all-powerful who does what He wills the way He wills. He created the universe by Himself, from nothing, with neither materials nor model. He said “be” and it became."
  },
  {
    "id": "70",
    "name_ar": "الْمُقْتَدِرُ",
    "name_tr": "Al-Muqtadir",
    "name_ms": "Maha Menentukan",
    "name_en": "Powerful",
    "desc_ms": "Allah Ya Muqtadir Yang Maha Menentukan menentukan segala sesuatu dan Dia memegang kekuasaan mutlak. Tidak ada sesiapa yang dapat menghalang kehendak dan ketentuanNya. Dengan kekuatan Allahlah berlaku sesuatu kehendakNya melalui makhlukNya, tanpa kekuatanNya, makhlukNya tidak mampu melakukan apa-apa pun.",
    "desc_en": "Allah is the one who creates all power and has total control over all power. Allah bestows power upon things on earth and in heaven, and uses them in accordance with His all-pervasive wisdom and will."
  },
  {
    "id": "71",
    "name_ar": "الْمُقَدِّمُ",
    "name_tr": "Al-Muqaddim",
    "name_ms": "Maha Mendahulukan",
    "name_en": "The Expediter",
    "desc_ms": "Allah Ya Muqaddim Yang Maha Mendahulukan mempunyai kuasa mutlak mendahulukan sesuatu mengikut kehendakNya. Dia mampu menyegerakan sesuatu perkara mengikut kehendakNya semahuNya. Seringkali Allah Ya Muqaddim mendahulukan kegagalan dan kesulitan sebelum diberiNya kejayaan yang lebih besar. Ternyata kesulitan itu adalah kejayaan dan keuntungan yang tiada taranya. Dengan kesulitan, akal akan berfikir mencari jalan keluar. Sesungguhnya ukuran kemajuan yang sebenarnya adalah darjat kedekatan seseorang pada Allah.",
    "desc_en": "Allah brings forward whomever He wills. Allah advances the chosen among His creation, bringing some above and ahead of others."
  },
  {
    "id": "72",
    "name_ar": "الْمُؤَخِّرُ",
    "name_tr": "Al-Mu’akhkhir",
    "name_ms": "Maha Mengakhirkan",
    "name_en": "The Delayer",
    "desc_ms": "Allah Ya Muakhkhir Yang Maha Mengakhirkan mampu mengakhirkan atau melambatkan sesuatu permintaan hambaNya. Dia memberi pada masa yang paling sesuai dan tepat untuk hambaNya dan keputusanNya penuh dengan kasih sayang dan kebijaksanaan.",
    "desc_en": "Allah is He who leaves whomever He wills behind, and delays advancement."
  },
  {
    "id": "73",
    "name_ar": "الأوَّلُ",
    "name_tr": "Al-Awwal",
    "name_ms": "Maha Awal",
    "name_en": "The First",
    "desc_ms": "Allah Ya Awwal telah sedia ada wujud dan kewujudanNya tiada permulaan. Tidak ada sesuatu pun yang mendahuluiNya. Dan kedahuluan Allah itu bersifat mutlak bukan kedahuluan yang relatif (nisbi). Segala sesuatu selain Allah adalah ciptaan Allah, semuanya baru ada setelah sebelumnya tiada.",
    "desc_en": "Allah is the first. There is none like Him. His firstness means that there is none prior to Him, that He is self-existent, that all comes from Him and that He is the cause of all that became."
  },
  {
    "id": "74",
    "name_ar": "الآخِرُ",
    "name_tr": "Al-Ākhir",
    "name_ms": "Maha Akhir",
    "name_en": "The Last",
    "desc_ms": "Allah Ya Akhir Yang Maha Akhir, ketika semua makhluk musnah, Dia tetap ada kekal abadi dan tiada pengakhirannya. Dia merupakan tujuan dan tempat bergantung yang seluruh makhluk menuju kepadaNya dengan ibadah, harapan, rasa takut dan seluruh keperluan mereka.",
    "desc_en": "Allah is the last. As He has no beginning, He has no end. He is eternal. He is the last in the sense that the circle of existence begins and ends with Him."
  },
  {
    "id": "75",
    "name_ar": "الظَّاهِرُ",
    "name_tr": "Al-Ẓāhir",
    "name_ms": "Maha Nyata",
    "name_en": "The Obvious",
    "desc_ms": "Allah Ya Zahir Yang Maha Nyata menegaskan kepada kita Dia nyata, dapat dilihat dan sesungguhnya hadir. Kehadiran Dia Ya Zohir kelihatan jelas pada setiap sesuatu yang dilihat. Disebalik keindahan dan keharmonian yang menakjubkan itu membuktikan adanya Allah Yang Maha Pencipta. Dia seperti cahaya yang membuat segalanya dapat dilihat, tetapi cahaya yang cukup hebat itu membuatnya tidak terlibat, tetapi Ya Zohir nyata dalam setiap sesuatu.",
    "desc_en": "Allah is the manifest one. Allah most high is hidden from those who seek to see by means of their senses, but He is apparent to those ho seek to know Him by the wisdom and reason that Allah has bestowed upon them."
  },
  {
    "id": "76",
    "name_ar": "الْبَاطِنُ",
    "name_tr": "Al-Bāṭin",
    "name_ms": "Maha Tersembunyi",
    "name_en": "The Hidden One",
    "desc_ms": "Allah Ya Batin yang Maha Ghaib sehingga kewujudanNya tidak mampu dilihat oleh fikiran manusia yang menjadi silau dan tumpul. Kita harus merenung sifat-sifat Allah dalam makhluk sekeliling kita tapi dilarang membayangkan DzatNya kerana ianya di luar kemampuan akal kita untuk memikirkan.",
    "desc_en": "Allah is the hidden one. His existence is both manifest and hidden. To truly know the creator is not possible because the knowledge, the mind the understanding of the created one are limited."
  },
  {
    "id": "77",
    "name_ar": "الْوَالِي",
    "name_tr": "Al-Wālī",
    "name_ms": "Maha Memerintah",
    "name_en": "The Protecting Friend",
    "desc_ms": "Allah Ya Waali Yang Maha Memerintah dan Maha Memberi, Dia memerintah dan mengawal alam semesta mengikut kehendakNya. Seluruh makhluk dikawal oleh ilmu dan kekuasaan Allah, dibawah kasih sayang, perlindungan dan belaianNya. Dia Ya Waali melindungi hamba-hambaNya daripada setiap bencana.",
    "desc_en": "Allah is the sole manager and governor of the whole creation."
  },
  {
    "id": "78",
    "name_ar": "الْمُتَعَالِي",
    "name_tr": "Al-Muta’ālī",
    "name_ms": "Maha Tinggi",
    "name_en": "The Supreme One",
    "desc_ms": "Allah Ya Muta'ali Yang Maha Tinggi yang ketinggianNya tidak terbatas dan akal manusia tidak dapat membayangkannya. Dia yang paling tinggi DzatNya, martabatNya, kedudukanNya, kemuliaanNya, kekayaanNya, kasih sayangNya dll.",
    "desc_en": "Allah is the Supreme One. His greatness grows. As He gives from His inexhaustible treasures, His riches increase. As the needs of His creation increase, His bounties increase."
  },
  {
    "id": "79",
    "name_ar": "الْبَرُّ",
    "name_tr": "Al-Barr",
    "name_ms": "Maha Dermawan",
    "name_en": "The Doer of Good",
    "desc_ms": "Allah Ya Barr Yang Maha Baik dan Dermawan menganugerahkan pelbagai jenis kebaikan kepada makhlkNya walaupun mereka derhaka dan tidak menyembahNya. KebaikanNya tergambar dalam sifat pemaafNya kepada hamba-hambaNya yang berdosa. Dia tidak terus menghukum, mereka diberi peluang untuk bertaubat dan diampunkan dosa-dosa itu.",
    "desc_en": "Allah is the perfect doe of good. All good and bounty come from Him. He loves for His servants only good, comfort and ease."
  },
  {
    "id": "80",
    "name_ar": "التَّوَابُ",
    "name_tr": "Al-Tawwāb",
    "name_ms": "Maha Penerima Taubat",
    "name_en": "The Guide to Repentance",
    "desc_ms": "Allah Ya Tawwab Yang Maha Penerima Taubat memberi dan menerima taubat hambaNya tanda kehalusan dan kelembutanNya kepada hamba-hambaNya. Allah tidak melihat kepada kesalahan dan keburukan perbuatannya, tetapi hamba itu perlu menyesali semua perkara buruk yang dilakukan dengan azam tidak mahu mengulangi dan takut dengan dosa tersebut. Allah bukan hanya menerima taubat, setelah hambaNya disucikan dari dosa, dialirkanNya kasih sayangNya dan cintaNya Ya Rahman Ya Rahim Ya Wadud. Allah Ya Tawwab seringkali memberi taubat dengan memberi anugerah musibah kepada hamba-hamba yang lupa memohon taubat, tetapi hukuman itu cukup ringan berbanding dengan Azab di akhirat kelak. Oleh itu hendaklah seseorang itu syukur dalam musibah.",
    "desc_en": "Allah is He who constantly turns man to repentance."
  },
  {
    "id": "81",
    "name_ar": "الْمُنْتَقِمُ",
    "name_tr": "Al-Muntaqim",
    "name_ms": "Maha Penyiksa",
    "name_en": "The Avenger",
    "desc_ms": "Allah Ya Muntaqim Yang Maha Penyiksa hanya menyiksa hamba-hambaNya yang sudah keterlaluan membuat kerosakan dan kezaliman di bumi ini serta menyengutukan Allah. Namun begitu, sebelum turun azab, Allah akan beri peringatan demi peringatan agar mereka bertaubat demi kasih sayang dan rahmatNya. Tetapi ketika mereka berterusan melakukan dosa dan tidak menghiraukan peringatan Allah dan merasa gembira dengan kejahatan itu, maka akan turunlah azab Ya Muntaqim. Bagi sesiapa yang memohon ampun segera setelah menyedari kesilapan, seringkali Allah mengampuninya tanpa menghukumnya.",
    "desc_en": "Allah is the great avenger. Allah punishes those who persist in revolting, raving in their unconsciousness and egotism, creating disharmony, tyrannising Allah’s servants and His creation."
  },
  {
    "id": "82",
    "name_ar": "العَفُوُّ",
    "name_tr": "Al-‘Afūw",
    "name_ms": "Maha Pemaaf",
    "name_en": "The Forgiver",
    "desc_ms": "Allah Ya ‘Afūw Yang Maha Pemaaf menghapuskan dan memadam dosa sama sekali. Allah suka memaaf dan menghapuskan dosa. Dia tidak menghukum segera hamba-hambaNya yang melakukan dosa agar mereka bertaubat dan memohon maaf kepada Allah. Walaupun neraka itu wujud, tetapi jalan untuk menyelamatkan diri terlalu banyak.",
    "desc_en": "Allah is the forgiver, the eliminator of sins. He does not often punish the ones who deny, the ones who revolt. He accepts their recognition of their sins as repentance. He erases their sins."
  },
  {
    "id": "83",
    "name_ar": "الرَّؤُوفُ",
    "name_tr": "Al-Ra’ūf",
    "name_ms": "Maha Pengasih",
    "name_en": "The Clement",
    "desc_ms": "Allah Ya Rouf Yang Maha Pelimpah Kasih mencipta alam ini dengan penuh limpahan kasih sayang. KasihNya diberikan kepada seluruh makhluk walaupun makhluk itu tidak berterima kasih kepadaNya. Tetapi kasih sayangNya seringkali dalam bentuk ujian dan penderitaan bagi membersihkan hamba-hambaNya supaya mereka dapat menerima cahaya dan kasihNya.",
    "desc_en": "Allah is all clement. In spite of His ability to see our sins, of His being just, of His being able to punish, the fact that He chooses to forgive proves His infinite mercy and clemency."
  },
  {
    "id": "84",
    "name_ar": "مَالِكُ الْمُلْكِ",
    "name_tr": "Mālik-ul-Mulk",
    "name_ms": "Maha Mempunyai Kerajaan",
    "name_en": "The Owner of All",
    "desc_ms": "Allah Ya Maalikal Mulki Yang Maha Memiliki Kerajaan memiliki kerajaan alam semesta di langit dan di bumi, di dunia dan di akhirat. Dia tidak merasa berat menguruskan dan mentadbir dan tidak memerlukan bantuan. Allah adalah Raja yang sebenarnya dan Dia memerintah dengan penuh keadilan. Di dunia Dia Ya Malikal Mulki memilih hamba-hambaNya menjadi raja bagi pihakNya dan Allah mengambilnya kembali dengan menurunkan takhtanya bila tiba masanya.",
    "desc_en": "Allah is the eternal owner of His kingdom. He shares neither the ownership nor the power, government or guardianship of the universe with anyone."
  },
  {
    "id": "85",
    "name_ar": "ذُوالْجَلاَلِ وَالإكْرَامِ",
    "name_tr": "Dhul-Jalāli-wal-Ikrām",
    "name_ms": "Maha Memiliki Kebesaran Serta Kemuliaan",
    "name_en": "Majestic and Benevolent",
    "desc_ms": "Allah Ya Dzal Jalaali Wal lkram Yang Maha Memiliki Kebesaran Dan Kemuliaan, semua kesempurnaan, kemuliaan dan rahmat datang dariNya. Dia mampu memberi dan mengambilnya kembali.",
    "desc_en": "Allah is the Lord of Majesty and bounty. There is no perfection that does not belong to Him nor any blessing or honor that comes from other than Him. Allah is the owner of all majesty."
  },
  {
    "id": "86",
    "name_ar": "الْمُقْسِطُ",
    "name_tr": "Al-Muqsiṭ",
    "name_ms": "Maha Adil",
    "name_en": "The Equitable One",
    "desc_ms": "Allah Ya Muqsit Yang Maha Adil mencipta dengan penuh keseimbangan dan mengkagumkan, harmoni dan seimbang penuh kesempurnaan. KeadilanNya memberikan kekayaan kepada sebahagian manusia dan kemiskinan kepada sebahagian yang lain, begitu juga memberi kelemahan kepada sebahagian yang lain dan kekuatan kepada yang lain. Dia memberi anugerahNya kepada setiap hambaNya dengan tepat. Allah Ya Muqsit juga membalas setiap amal kebaikan, budi pekerti yang mulia dengan ganjaran yg penuh adil dan setimpal.",
    "desc_en": "Allah is the one who acts and distributes in justice and fairness. How harmonious and balanced is the creation: all the beauties in heaven and earth-mountains, seas, sunsets, flowers – and also the eyes to see."
  },
  {
    "id": "87",
    "name_ar": "الْجَامِعُ",
    "name_tr": "Al-Jāmi’",
    "name_ms": "Maha Pengumpul",
    "name_en": "The Gatherer",
    "desc_ms": "Allah Ya Jami' Yang Maha Menghimpun akan menghimpunkan orang-orang yang telah mati dan dihidupkan kembali untuk dihitung oleh Allah Ya Muhsi, dihisab oleh Ya Hasib ,dibalas oleh Ya Muntaqim dan diadili oleh Ya Adl. Di hari penghimpunan, manusia akan sedar siapakah Allah sebenarnya yang mana di dunia ini mereka tidak takuti akan azabNya, tidak bersyukur akan nikmatNya. Di hari penghimpunan ini, manusia yang sentiasa ingat Allah akan mendapat perhatian istimewa dariNya.",
    "desc_en": "Allah is the gatherer of whatever He wishes, wherever He wishes. Allah has gathered together within this universe spaces, galaxies-stars, earths, seas, plants and animals, things whose nature, size, shape and colour are different."
  },
  {
    "id": "88",
    "name_ar": "الْغَنِيُّ",
    "name_tr": "Al-Ghanīy",
    "name_ms": "Maha Kaya",
    "name_en": "The Rich One",
    "desc_ms": "Allah Ya Ghaniyy Yang Maha Kaya memiliki seluruh kekayaan langit dan bumi. Kekayaan yang ada pada orang kaya itu adalah kekayaan Allah. Dia mampu memberi kekayaan kepada sesiapa yang Dia kehendaki dan mengambil kembali kekayaan tersebut. Kekayaan Allah tidak mampu dilihat dengan mata kasar kerana yang nampak itu hanyalah terlalu sedikit dari kekayaanNya yang ada.",
    "desc_en": "Allah is the rich one who is self sufficient. His essence and attributes have no relationship to anything else. Someone whose existence and perfection depend on another needs to earn that existence. Only Allah needs not, neither does He need to earn."
  },
  {
    "id": "89",
    "name_ar": "الْمُغْنِي",
    "name_tr": "Al-Mughnī",
    "name_ms": "Maha Mengkayakan",
    "name_en": "The Enricher",
    "desc_ms": "Allah Ya Mughni Yang Maha Pemberi Kekayaan suka memberi kekayaan kepada hamba-hambaNya. Kekayaan Allah bukan hanya dalam bentuk harta benda, tetapi juga Dia mampu memberi kekayaan jiwa sehingga sesiapa yang dikurniakan kekayaan jiwa, mereka akan menjadi seorang yang redha dan tenang dalam hidupnya.",
    "desc_en": "Allah is the enricher. He renders whomever He wishes rich and whomever He wishes poor."
  },
  {
    "id": "90",
    "name_ar": "اَلْمَانِعُ",
    "name_tr": "Al-Māni’",
    "name_ms": "Maha Mencegah",
    "name_en": "The Hinderer",
    "desc_ms": "Allah Ya Maani' yang maha mencegah sentiasa mencegah hamba-hamba pilihanNya daripada melakukan kemaksiatan kepadaNya. Allah Ya Maani' seringkali mencegah dengan cara memberi ujian kesusahan, kesempitan dan kesakitan ketika hambaNya lalai kepadaNya.",
    "desc_en": "Allah is the one who averts harm from His creation."
  },
  {
    "id": "91",
    "name_ar": "الضَّارَّ",
    "name_tr": "Al-Ḍārr",
    "name_ms": "Maha Pemberi Derita",
    "name_en": "The Creator of The Harmful",
    "desc_ms": "Allah Ya Dhoorru Yang Maha Pemberi Derita mampu memberi penderitaan kepada hamba-hambaNya bagi mengingatkan mereka tentang kesilapan yang dilakukan. Allah memberi hukuman kepada hambaNya yang memohon taubat kepadaNya sebagai pengajaran dan ia merupakan sebahagian dari proses penyucian dari dosa yang telah dilakukan. Allah Ya Dhooru bukan memberi penderitaan kerana benci kepada hamba-hambaNya, tetapi lebih kepada hukuman dan pelajaran kepada hambaNya agar mereka insaf dengan kesalahan yang dilakukan.",
    "desc_en": "Allah is the creator of the harmful and evil as He is the creator of the good and beneficial. Ha has also taught us to opt for the good and escape the evil. Ha has given us power of discrimination, given us a will and freedom to choose."
  },
  {
    "id": "92",
    "name_ar": "النَّافِعُ",
    "name_tr": "Al-Nāfi’",
    "name_ms": "Maha Pemberi Manfaat",
    "name_en": "The Creator of Good",
    "desc_ms": "Allah Ya Naafi' Yang Maha Pemberi Manfaat mampu memberikan manfaat kepada hamba-hambaNya. Setiap manfaat yang diterima oleh setiap manusia datangnya dari Allah Ya Naafii'. Dia mampu memberi manfaat dan mampu menarik kembali manfaat dengan memberikan mudarat.",
    "desc_en": "Allah is the creator of good. Allah has created man as the best of his creation and He has bestowed upon him gifts which render him unique and superior to the rest of creation."
  },
  {
    "id": "93",
    "name_ar": "النُّورُ",
    "name_tr": "Al-Nūr",
    "name_ms": "Maha Pemberi Cahaya",
    "name_en": "The Light",
    "desc_ms": "Allah Yaa Nuur Yang Maha Bercahaya mampu memberikan cahaya kepada jiwa manusia yang mana jiwa yang mendapat cahaya Allah akan pasti mendapat bimbingan dan cinta Allah. Allah juga memberikan cahayaNya kepada kehidupan di bumi dengan memancarkan cahaya An—NuurNya melalui matahari. Dialah sumber semua cahaya di seluruh alam semesta ini.",
    "desc_en": "Allah is the light that is shed upon the whole creation, making it apparent. That light is the light that brought existence out of the darkness of non-existence."
  },
  {
    "id": "94",
    "name_ar": "الْهَادِي",
    "name_tr": "Al-Hādī",
    "name_ms": "Maha Pemberi Petunjuk",
    "name_en": "The Guide",
    "desc_ms": "Allah Ya Haadi Yang Maha Memberi Petunjuk memberi petunjuk dan hidayah kepada hamba-hamba pilihanNya. Dia sahaja yang mampu memberi petunjuk, bimbingan dan hidayah kepada jalan yang lurus. Sekiranya Ya Haadi tidak memberikan hidayah, tiada siapa yang mampu memberinya, maka akan sesatlah seseorang yang tidak dibimbing Allah Ya Haadi.",
    "desc_en": "Allah is the one who creates guidance, leading his servants to good, benficence and the satisfaction of their needs."
  },
  {
    "id": "95",
    "name_ar": "الْبَدِيعُ",
    "name_tr": "Al-Badī’",
    "name_ms": "Maha Pencipta",
    "name_en": "The Originator",
    "desc_ms": "Allah Ya Badi, yang maha pencipta keindahan mencipta alam ini penuh dengan keindahan dan kecantikan. Manusia harus merenungi keindahan ciptaan Allah dan memuja memuji Allah atas kehebatanNya.",
    "desc_en": "Allah is the Originator of the creation, having created it without model or material. He does not need previous knowledge to think, to first investigate, to figure things out. Everything He creates is a wonder since He originated it from nothing."
  },
  {
    "id": "96",
    "name_ar": "اَلْبَاقِي",
    "name_tr": "Al-Bāqī",
    "name_ms": "Maha Kekal",
    "name_en": "The Everlasting One",
    "desc_ms": "Allah Ya Baaqi Yang Maha Kekal akan tetap kekal, tidak akan hancur dan musnah. Tetapi sebaliknya makhluk ciptaanNya akan pasti hancur dan musnah satu hari nanti dan bersifat sementara.",
    "desc_en": "Allah is the everlasting one whose existence in the future is forever. He has neither beginning nor end. The creation will end, and time with it. But Allah the everlasting one will still exist."
  },
  {
    "id": "97",
    "name_ar": "الْوَارِثُ",
    "name_tr": "Al-Wārith",
    "name_ms": "Maha Mewarisi",
    "name_en": "The Inheritor of All",
    "desc_ms": "Allah Ya Waarith Maha Mewarisi segala apa yang ada di alam semesta ini kerana Dialah yang memiliki dan semuanya akan kembali kepadaNya. Dia Ya Waarith berhak mewariskan apa sahaja kepada siapa sahaja. Allah Ya Waarith mewariskan syurga kepada hambaNya yang bertaqwa dan sebaliknya Dia mewariskan hukuman kepada hambaNya yang melakukan kejahatan.",
    "desc_en": "Allah is the ultimate inheritor, to whom everything is left after its temporal possessors are gone. It is He who exists after all existence disappears, it is He to whom all existence returns."
  },
  {
    "id": "98",
    "name_ar": "الرَّشِيدُ",
    "name_tr": "Al-Rashīd",
    "name_ms": "Maha Bijaksana",
    "name_en": "The Righteous Teacher",
    "desc_ms": "Allah Ya Rashid Yang Maha Pintar, pandai dan cerdik dalam memberi petunjuk kepada hambaNya ke arah kebaikan dan dengan kepintaranNya Ya Rashid menyelesaikan segala permasalahan makhlukNya. Ya Rashid merupakan guru terhebat dan tertinggi yang mengajar kita menghadapi kehidupan ini mengikut kehendakNya dan seterusnya mencapai kebahagiaan dunia dan akhirat.",
    "desc_en": "Allah is the righteous teacher who ordains righteousness for all creatures. In His wisdom He leads all matters to their finality in a perfect way and order."
  },
  {
    "id": "99",
    "name_ar": "الصَّبُورُ",
    "name_tr": "Al-Ṣabūr",
    "name_ms": "Maha Sabar",
    "name_en": "The Patient One",
    "desc_ms": "Allah Ya Sobur Maha Sabar dalam segala tindakanNya. Ya Sobur tidak bersifat tergesa-gesa dan terburu-buru dalam mengambil apa jua tindakan terhadap makhlukNya. Manusia yang melakukan dosa diberi peluang oleh Allah untuk insaf dan bertaubat, mereka tidak dihukum serta merta. Segala yang Allah Ya Sobur lakukan tepat pada waktunya dengan cara yang sebaiknya dan sepatutnya.",
    "desc_en": "Allah is the most patient one. In His creation as in His actions, in His dealings with His creation, nothing is either bigger or smaller, better or worse, earlier or later than is determined for it to be."
  }
]